Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum
Defines the subsection subtypes.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.UNKNOWN_SUBTYPE
The subsection subtype is unknown.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.I_HOT_ROLLED
The hot rolled I profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.I_WELDED_SYMMETRICAL
The first symmetrically welded I profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.I_WELDED_UNSYMMETRICAL
The first unsymmetrically welded I profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.I_WELDED_SYMMETRICAL2
The second symmetrically welded I profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.I_WELDED_UNSYMMETRICAL2
The second unsymmetrically welded I profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.L_HOT_ROLLED
The hot rolled L profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.L_COLD_ROLLED
The cold rolled L profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.Z_COLD_ROLLED
The cold rolled Z profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.U_HOT_ROLLED
The hot rolled U profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.U_COLD_ROLLED
The cold rolled U profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.PL_DEFAULT
The default PL profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.D_CIRCULAR
The circular D profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.D_ELLIPTICAL
The elliptical D profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.PD_CIRCULAR
The circular PD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.PD_ELLIPTICAL
The elliptical PD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.PD_CIRCULAR_TAPERED
The circular tapered PD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.P_SQUARE
The square P profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.P_RECTANGULAR
The rectangular P profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.P_ALTERING_HEIGHT
The altering height P profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.C_HOT_ROLLED
The hot rolled C profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.C_COLD_ROLLED
The cold rolled C profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.T_HOT_ROLLED
The hot rolled T profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.T_PARAMETRIC
The parametric T profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.HK_SYMMETRICAL
The symmetrical HK profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.HK_UNSYMMETRICAL
The unsymmetrical HK profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.HQ_CENTERED
The centered HQ profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.HQ_NOT_CENTERED
The not centered HQ profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.ZZ_SYMMETRICAL
The symmetrical ZZ profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.ZZ_NOT_SYMMETRICAL
The unsymmetrical ZZ profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CC_SYMMETRICAL
The symmetrical CC profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CC_NOT_SYMMETRICAL
The unsymmetrical CC profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CW_SYMMETRICAL
The symmetrical CW profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CW_UNSYMMETRICAL
The unsymmetrical CW profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CU_SYMMETRICAL
The symmetrical CU profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.CU_NOT_SYMMETRICAL
The unsymmetrical CU profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EB_SYMMETRICAL
The symmetrical EB profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EB_NOT_SYMMETRICAL
The unsymmetrical EB profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.BF_DEFAULT
The default BF profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.SPD_CIRCULAR
The circular SPD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.SPD_ELLIPTICAL
The elliptical SPD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.SPD_CIRCULAR_TAPERED
The circular tapered SPD profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EC_SYMMETRICAL
The symmetrical EC profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EC_NOT_SYMMETRICAL
The unsymmetrical EC profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.ED_DEFAULT
The default ED profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EE_DEFAULT
The default EE profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EF_DEFAULT
The default EF profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EZ_DEFAULT
The default EZ profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.EW_DEFAULT
The default EW profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCDL_SYMMETRICAL
The symmetrical RCDL profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCDL_UNSYMMETRICAL
The unsymmetrical RCDL profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCXX_DEFAULT
The default RCXX profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCL_DEFAULT
The default RCL profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCDX_SYMMETRICAL
The symmetrical RCDX profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCDX_UNSYMMETRICAL
The first unsymmetrical RCDX profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCDX_UNSYMMETRICAL2
The second unsymmetrical RCDX profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.RCX_DEFAULT
The default RCX profile.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionSubTypeEnum.COMPONENT_FIRST
The component first type.